[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:35:23
   astGrepVersion: string | null;
 }
 
-const COLLECTION_TS = /\)\s*:\s*(Array<[^>]+>|ReadonlyArray<[^>]+>|Set<[^>]+>|Map<[^,>]+,\s*[^>]+>|Iterator<[^>]+>|Iterable<[^>]+>|[A-Za-z_$][\w$]*\[\])/;
+const COLLECTION_TS = /\)\s*:\s*(Array<[^>]>|ReadonlyArray<[^>]+>|Set<[^>]+>|Map<[^,>]+,\s*[^>]+>|Iterator<[^>]+>|Iterable<[^>]+>|[A-Za-z_$][\w$]*\[\])/;
 const FUNCTION_TS = /^\s*(?:export\s+)?(?:async\s+)?(?:function\s+(\w+)\s*[<(]|const\s+(\w+)\s*(?::\s*[^=]+?)?\s*=\s*(?:async\s+)?\([^)]*\)\s*(?::\s*[^=]+?)?\s*=>)/;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:35:23
   astGrepVersion: string | null;
 }
 
-const COLLECTION_TS = /\)\s*:\s*(Array<[^>]+>|ReadonlyArray<[^>]+>|Set<[^>]+>|Map<[^,>]+,\s*[^>]+>|Iterator<[^>]+>|Iterable<[^>]+>|[A-Za-z_$][\w$]*\[\])/;
+const COLLECTION_TS = /\)\s*:\s*(Array<[^>]+>|ReadonlyArray<[^>]+>|Set<[^>]+>|Map<[^,>]+,\s*[^>]+>|Iterator<[^>]+>|Iterable<[^>]+>|[A-Za-z_$][\W$]*\[\])/;
 const FUNCTION_TS = /^\s*(?:export\s+)?(?:async\s+)?(?:function\s+(\w+)\s*[<(]|const\s+(\w+)\s*(?::\s*[^=]+?)?\s*=\s*(?:async\s+)?\([^)]*\)\s*(?::\s*[^=]+?)?\s*=>)/;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan flags TS nested-for as nxm-overlap (FAILS if loop counting/threshold broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:36:21
 }
 
 const COLLECTION_TS = /\)\s*:\s*(Array<[^>]+>|ReadonlyArray<[^>]+>|Set<[^>]+>|Map<[^,>]+,\s*[^>]+>|Iterator<[^>]+>|Iterable<[^>]+>|[A-Za-z_$][\w$]*\[\])/;
-const FUNCTION_TS = /^\s*(?:export\s+)?(?:async\s+)?(?:function\s+(\w+)\s*[<(]|const\s+(\w+)\s*(?::\s*[^=]+?)?\s*=\s*(?:async\s+)?\([^)]*\)\s*(?::\s*[^=]+?)?\s*=>)/;
+const FUNCTION_TS = /^\s*(?:export\s+)?(?:async\s+)?(?:function\s+(\w+)\s*[<(]|const\S+(\w+)\s*(?::\s*[^=]+?)?\s*=\s*(?:async\s+)?\([^)]*\)\s*(?::\s*[^=]+?)?\s*=>)/;
 const FUNCTION_PY = /^\s*def\s+(\w+)\s*\(/;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan TS arrow function const detected via m[2] capture (FAILS if m[1] || m[2] fallback broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:36:21
 }
 
 const COLLECTION_TS = /\)\s*:\s*(Array<[^>]+>|ReadonlyArray<[^>]+>|Set<[^>]+>|Map<[^,>]+,\s*[^>]+>|Iterator<[^>]+>|Iterable<[^>]+>|[A-Za-z_$][\w$]*\[\])/;
-const FUNCTION_TS = /^\s*(?:export\s+)?(?:async\s+)?(?:function\s+(\w+)\s*[<(]|const\s+(\w+)\s*(?::\s*[^=]+?)?\s*=\s*(?:async\s+)?\([^)]*\)\s*(?::\s*[^=]+?)?\s*=>)/;
+const FUNCTION_TS = /^\s*(?:export\s+)?(?:async\s+)?(?:function\S+(\w+)\s*[<(]|const\s+(\w+)\s*(?::\s*[^=]+?)?\s*=\s*(?:async\s+)?\([^)]*\)\s*(?::\s*[^=]+?)?\s*=>)/;
 const FUNCTION_PY = /^\s*def\s+(\w+)\s*\(/;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Survived] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:38:21
 const COLLECTION_TS = /\)\s*:\s*(Array<[^>]+>|ReadonlyArray<[^>]+>|Set<[^>]+>|Map<[^,>]+,\s*[^>]+>|Iterator<[^>]+>|Iterable<[^>]+>|[A-Za-z_$][\w$]*\[\])/;
 const FUNCTION_TS = /^\s*(?:export\s+)?(?:async\s+)?(?:function\s+(\w+)\s*[<(]|const\s+(\w+)\s*(?::\s*[^=]+?)?\s*=\s*(?:async\s+)?\([^)]*\)\s*(?::\s*[^=]+?)?\s*=>)/;
-const FUNCTION_PY = /^\s*def\s+(\w+)\s*\(/;
+const FUNCTION_PY = /^\s*def\s(\w+)\s*\(/;
 const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:40:21
 const FUNCTION_PY = /^\s*def\s+(\w+)\s*\(/;
-const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;
+const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\S+(\w+)\s*(?:<[^>]+>)?\s*\(/;
 const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
 const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects C# method returning List<T> with nested for+foreach (FAILS if csharp dispatch broken)
statusReason: expected 'd' to be 'Build' // Object.is equality

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:40:21
 const FUNCTION_PY = /^\s*def\s+(\w+)\s*\(/;
-const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;
+const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)\s*\(/;
 const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
 const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects C# method returning List<T> with nested for+foreach (FAILS if csharp dispatch broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:41:21
 const FUNCTION_PY = /^\s*def\s+(\w+)\s*\(/;
 const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;
-const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
+const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s$/;
 const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
 const SUPPRESS_CS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan suppressed.function string format = name:1-indexed-line (FAILS if +1 → -1 off-by-one)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:41:21
 const FUNCTION_PY = /^\s*def\s+(\w+)\s*\(/;
 const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;
-const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
+const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*/;
 const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
 const SUPPRESS_CS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan reason string preserved verbatim including punctuation (FAILS if .trim() removes content / regex captures too greedy)
statusReason: expected 'p' to be 'pure-leaf reducer — type system enfor…' // Object.is equality

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:42:21
 const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;
 const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
-const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
+const SUPPRESS_PY = /#\S*strong-tests:skip\s+(.+?)\s*$/;
 const SUPPRESS_CS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
 
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Survived] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:42:21
 const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;
 const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
-const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
+const SUPPRESS_PY = /#\s*strong-tests:skip\s(.+?)\s*$/;
 const SUPPRESS_CS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
 

[Survived] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:43:21
 const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;
 const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
 const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
-const SUPPRESS_CS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
+const SUPPRESS_CS = /\/\/\S*strong-tests:skip\s+(.+?)\s*$/;
 
 function detectStack(filePath: string): Stack | null {

[Survived] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:43:21
 const FUNCTION_CS = /^\s*(?:(?:public|private|protected|internal|static|async|virtual|override|abstract|partial|sealed|new|readonly)\s+){1,6}[\w.<>,\s\[\]?]+\s+(\w+)\s*(?:<[^>]+>)?\s*\(/;
 const SUPPRESS_TS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
 const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
-const SUPPRESS_CS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
+const SUPPRESS_CS = /\/\/\sstrong-tests:skip\s+(.+?)\s*$/;
 
 function detectStack(filePath: string): Stack | null {

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:45:54
 const SUPPRESS_PY = /#\s*strong-tests:skip\s+(.+?)\s*$/;
 const SUPPRESS_CS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
 
-function detectStack(filePath: string): Stack | null {
-  const ext = path.extname(filePath).toLowerCase();
-  if (ext === '.ts' || ext === '.tsx') return 'ts';
-  if (ext === '.py') return 'python';
-  if (ext === '.cs') return 'csharp';
-  return null;
-}
+function detectStack(filePath: string): Stack | null {}
 
 // strong-tests:skip pure-leaf mapping: kind+returnType → hardcoded invariants taxonomy
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API detectStack returns "ts" for .ts files (FAILS if extension matcher misses TypeScript)
statusReason: expected undefined to be 'ts' // Object.is equality

[Killed] MethodExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:46:15
 const SUPPRESS_CS = /\/\/\s*strong-tests:skip\s+(.+?)\s*$/;
 
 function detectStack(filePath: string): Stack | null {
-  const ext = path.extname(filePath).toLowerCase();
+  const ext = path.extname(filePath).toUpperCase();
   if (ext === '.ts' || ext === '.tsx') return 'ts';
   if (ext === '.py') return 'python';
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API detectStack returns "ts" for .ts files (FAILS if extension matcher misses TypeScript)
statusReason: expected null to be 'ts' // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:47:7
 
 function detectStack(filePath: string): Stack | null {
   const ext = path.extname(filePath).toLowerCase();
-  if (ext === '.ts' || ext === '.tsx') return 'ts';
+  if (false) return 'ts';
   if (ext === '.py') return 'python';
   if (ext === '.cs') return 'csharp';
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API detectStack returns "ts" for .ts files (FAILS if extension matcher misses TypeScript)
statusReason: expected null to be 'ts' // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:47:7
 
 function detectStack(filePath: string): Stack | null {
   const ext = path.extname(filePath).toLowerCase();
-  if (ext === '.ts' || ext === '.tsx') return 'ts';
+  if (false || ext === '.tsx') return 'ts';
   if (ext === '.py') return 'python';
   if (ext === '.cs') return 'csharp';
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API detectStack returns "ts" for .ts files (FAILS if extension matcher misses TypeScript)
statusReason: expected null to be 'ts' // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:48:7
 function detectStack(filePath: string): Stack | null {
   const ext = path.extname(filePath).toLowerCase();
   if (ext === '.ts' || ext === '.tsx') return 'ts';
-  if (ext === '.py') return 'python';
+  if (ext !== '.py') return 'python';
   if (ext === '.cs') return 'csharp';
   return null;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API detectStack returns "python" for .py files (FAILS if Python branch removed)
statusReason: expected null to be 'python' // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:48:7
 function detectStack(filePath: string): Stack | null {
   const ext = path.extname(filePath).toLowerCase();
   if (ext === '.ts' || ext === '.tsx') return 'ts';
-  if (ext === '.py') return 'python';
+  if (false) return 'python';
   if (ext === '.cs') return 'csharp';
   return null;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API detectStack returns "python" for .py files (FAILS if Python branch removed)
statusReason: expected null to be 'python' // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:49:7
   const ext = path.extname(filePath).toLowerCase();
   if (ext === '.ts' || ext === '.tsx') return 'ts';
   if (ext === '.py') return 'python';
-  if (ext === '.cs') return 'csharp';
+  if (true) return 'csharp';
   return null;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API detectStack returns null for unknown extensions (FAILS if stack fallback returns wrong value)
statusReason: expected 'csharp' to be null // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:49:7
   const ext = path.extname(filePath).toLowerCase();
   if (ext === '.ts' || ext === '.tsx') return 'ts';
   if (ext === '.py') return 'python';
-  if (ext === '.cs') return 'csharp';
+  if (ext !== '.cs') return 'csharp';
   return null;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API detectStack returns "csharp" for .cs files (FAILS if .cs branch removed — primary C# regression guard)
statusReason: expected null to be 'csharp' // Object.is equality

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:54:83
 }
 
 // strong-tests:skip pure-leaf mapping: kind+returnType → hardcoded invariants taxonomy
-function suggestInvariants(kind: Candidate['kind'], returnType: string): string[] {
-  const base = ['cardinality', 'uniqueness'];
-  if (kind === 'nxm-overlap') return [...base, 'conservation'];
-  if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
-  if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
-  if (/Iterator|Iterable/.test(returnType)) return [...base, 'idempotence', 'monotonicity'];
-  return [...base, 'conservation'];
-}
+function suggestInvariants(kind: Candidate['kind'], returnType: string): string[] {}
 
 function functionRegexFor(stack: Stack): RegExp {
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants always includes cardinality + uniqueness (FAILS if base set changed)
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:55:17
 
 // strong-tests:skip pure-leaf mapping: kind+returnType → hardcoded invariants taxonomy
 function suggestInvariants(kind: Candidate['kind'], returnType: string): string[] {
-  const base = ['cardinality', 'uniqueness'];
+  const base = ["", 'uniqueness'];
   if (kind === 'nxm-overlap') return [...base, 'conservation'];
   if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants always includes cardinality + uniqueness (FAILS if base set changed)
statusReason: expected [ '', 'uniqueness', 'conservation' ] to include 'cardinality'

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:56:7
 // strong-tests:skip pure-leaf mapping: kind+returnType → hardcoded invariants taxonomy
 function suggestInvariants(kind: Candidate['kind'], returnType: string): string[] {
   const base = ['cardinality', 'uniqueness'];
-  if (kind === 'nxm-overlap') return [...base, 'conservation'];
+  if (kind !== 'nxm-overlap') return [...base, 'conservation'];
   if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
   if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants adds conservation+monotonicity for composition-chain (FAILS if mapping changed)
statusReason: expected [ 'cardinality', 'uniqueness', …(1) ] to deeply equal [ 'cardinality', 'uniqueness', …(2) ]

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:56:7
 // strong-tests:skip pure-leaf mapping: kind+returnType → hardcoded invariants taxonomy
 function suggestInvariants(kind: Candidate['kind'], returnType: string): string[] {
   const base = ['cardinality', 'uniqueness'];
-  if (kind === 'nxm-overlap') return [...base, 'conservation'];
+  if (true) return [...base, 'conservation'];
   if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
   if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants adds conservation+monotonicity for composition-chain (FAILS if mapping changed)
statusReason: expected [ 'cardinality', 'uniqueness', …(1) ] to deeply equal [ 'cardinality', 'uniqueness', …(2) ]

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:57:7
 function suggestInvariants(kind: Candidate['kind'], returnType: string): string[] {
   const base = ['cardinality', 'uniqueness'];
   if (kind === 'nxm-overlap') return [...base, 'conservation'];
-  if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
+  if (true) return [...base, 'conservation', 'monotonicity'];
   if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
   if (/Iterator|Iterable/.test(returnType)) return [...base, 'idempotence', 'monotonicity'];
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants adds coverage+no-leak for Dictionary/Map return types (FAILS if dict branch removed)
statusReason: expected [ 'cardinality', 'uniqueness', …(2) ] to deeply equal [ 'cardinality', 'uniqueness', …(2) ]

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:57:7
 function suggestInvariants(kind: Candidate['kind'], returnType: string): string[] {
   const base = ['cardinality', 'uniqueness'];
   if (kind === 'nxm-overlap') return [...base, 'conservation'];
-  if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
+  if (kind !== 'composition-chain') return [...base, 'conservation', 'monotonicity'];
   if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
   if (/Iterator|Iterable/.test(returnType)) return [...base, 'idempotence', 'monotonicity'];
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants adds conservation+monotonicity for composition-chain (FAILS if mapping changed)
statusReason: expected [ 'cardinality', 'uniqueness', …(1) ] to deeply equal [ 'cardinality', 'uniqueness', …(2) ]

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:58:7
   const base = ['cardinality', 'uniqueness'];
   if (kind === 'nxm-overlap') return [...base, 'conservation'];
   if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
-  if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
+  if (true) return [...base, 'coverage', 'no-leak'];
   if (/Iterator|Iterable/.test(returnType)) return [...base, 'idempotence', 'monotonicity'];
   return [...base, 'conservation'];
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants adds idempotence+monotonicity for Iterator/Iterable types (FAILS if iter branch removed)
statusReason: expected [ 'cardinality', 'uniqueness', …(2) ] to deeply equal [ 'cardinality', 'uniqueness', …(2) ]

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:58:7
   const base = ['cardinality', 'uniqueness'];
   if (kind === 'nxm-overlap') return [...base, 'conservation'];
   if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
-  if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
+  if (false) return [...base, 'coverage', 'no-leak'];
   if (/Iterator|Iterable/.test(returnType)) return [...base, 'idempotence', 'monotonicity'];
   return [...base, 'conservation'];
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants adds coverage+no-leak for Dictionary/Map return types (FAILS if dict branch removed)
statusReason: expected [ 'cardinality', 'uniqueness', …(1) ] to deeply equal [ 'cardinality', 'uniqueness', …(2) ]

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:59:7
   if (kind === 'nxm-overlap') return [...base, 'conservation'];
   if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
   if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
-  if (/Iterator|Iterable/.test(returnType)) return [...base, 'idempotence', 'monotonicity'];
+  if (false) return [...base, 'idempotence', 'monotonicity'];
   return [...base, 'conservation'];
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants adds idempotence+monotonicity for Iterator/Iterable types (FAILS if iter branch removed)
statusReason: expected [ 'cardinality', 'uniqueness', …(1) ] to deeply equal [ 'cardinality', 'uniqueness', …(2) ]

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:59:7
   if (kind === 'nxm-overlap') return [...base, 'conservation'];
   if (kind === 'composition-chain') return [...base, 'conservation', 'monotonicity'];
   if (/dict|Map|Dict/i.test(returnType)) return [...base, 'coverage', 'no-leak'];
-  if (/Iterator|Iterable/.test(returnType)) return [...base, 'idempotence', 'monotonicity'];
+  if (true) return [...base, 'idempotence', 'monotonicity'];
   return [...base, 'conservation'];
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API suggestInvariants falls back to cardinality+uniqueness+conservation for generic list types (FAILS if default branch wrong)
statusReason: expected [ 'cardinality', 'uniqueness', …(2) ] to deeply equal [ 'cardinality', 'uniqueness', …(1) ]

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:63:49
   return [...base, 'conservation'];
 }
 
-function functionRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return FUNCTION_TS;
-  if (stack === 'python') return FUNCTION_PY;
-  return FUNCTION_CS;
-}
+function functionRegexFor(stack: Stack): RegExp {}
 
 function collectionRegexFor(stack: Stack): RegExp {
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan returns empty candidates/suppressed for empty content (FAILS if scan crashes on empty)
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:64:7
 }
 
 function functionRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return FUNCTION_TS;
+  if (stack !== 'ts') return FUNCTION_TS;
   if (stack === 'python') return FUNCTION_PY;
   return FUNCTION_CS;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:64:7
 }
 
 function functionRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return FUNCTION_TS;
+  if (true) return FUNCTION_TS;
   if (stack === 'python') return FUNCTION_PY;
   return FUNCTION_CS;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects C# method returning List<T> with nested for+foreach (FAILS if csharp dispatch broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:65:7
 
 function functionRegexFor(stack: Stack): RegExp {
   if (stack === 'ts') return FUNCTION_TS;
-  if (stack === 'python') return FUNCTION_PY;
+  if (stack !== 'python') return FUNCTION_PY;
   return FUNCTION_CS;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects C# method returning List<T> with nested for+foreach (FAILS if csharp dispatch broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:65:7
 
 function functionRegexFor(stack: Stack): RegExp {
   if (stack === 'ts') return FUNCTION_TS;
-  if (stack === 'python') return FUNCTION_PY;
+  if (true) return FUNCTION_PY;
   return FUNCTION_CS;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects C# method returning List<T> with nested for+foreach (FAILS if csharp dispatch broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:69:51
   return FUNCTION_CS;
 }
 
-function collectionRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return COLLECTION_TS;
-  if (stack === 'python') return COLLECTION_PY;
-  return COLLECTION_CS;
-}
+function collectionRegexFor(stack: Stack): RegExp {}
 
 function suppressRegexFor(stack: Stack): RegExp {
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:70:7
 }
 
 function collectionRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return COLLECTION_TS;
+  if (true) return COLLECTION_TS;
   if (stack === 'python') return COLLECTION_PY;
   return COLLECTION_CS;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects C# method returning List<T> with nested for+foreach (FAILS if csharp dispatch broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:70:7
 }
 
 function collectionRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return COLLECTION_TS;
+  if (false) return COLLECTION_TS;
   if (stack === 'python') return COLLECTION_PY;
   return COLLECTION_CS;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:71:7
 
 function collectionRegexFor(stack: Stack): RegExp {
   if (stack === 'ts') return COLLECTION_TS;
-  if (stack === 'python') return COLLECTION_PY;
+  if (true) return COLLECTION_PY;
   return COLLECTION_CS;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects C# method returning List<T> with nested for+foreach (FAILS if csharp dispatch broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:71:7
 
 function collectionRegexFor(stack: Stack): RegExp {
   if (stack === 'ts') return COLLECTION_TS;
-  if (stack === 'python') return COLLECTION_PY;
+  if (stack !== 'python') return COLLECTION_PY;
   return COLLECTION_CS;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects C# method returning List<T> with nested for+foreach (FAILS if csharp dispatch broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:75:49
   return COLLECTION_CS;
 }
 
-function suppressRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return SUPPRESS_TS;
-  if (stack === 'python') return SUPPRESS_PY;
-  return SUPPRESS_CS;
-}
+function suppressRegexFor(stack: Stack): RegExp {}
 
 function nestedLoopCount(body: string, stack: Stack): number {
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan returns empty candidates/suppressed for empty content (FAILS if scan crashes on empty)
statusReason: Cannot read properties of undefined (reading 'trim')
