[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:76:7
 }
 
 function suppressRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return SUPPRESS_TS;
+  if (true) return SUPPRESS_TS;
   if (stack === 'python') return SUPPRESS_PY;
   return SUPPRESS_CS;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:76:7
 }
 
 function suppressRegexFor(stack: Stack): RegExp {
-  if (stack === 'ts') return SUPPRESS_TS;
+  if (stack !== 'ts') return SUPPRESS_TS;
   if (stack === 'python') return SUPPRESS_PY;
   return SUPPRESS_CS;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:77:7
 
 function suppressRegexFor(stack: Stack): RegExp {
   if (stack === 'ts') return SUPPRESS_TS;
-  if (stack === 'python') return SUPPRESS_PY;
+  if (stack !== 'python') return SUPPRESS_PY;
   return SUPPRESS_CS;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:77:7
 
 function suppressRegexFor(stack: Stack): RegExp {
   if (stack === 'ts') return SUPPRESS_TS;
-  if (stack === 'python') return SUPPRESS_PY;
+  if (false) return SUPPRESS_PY;
   return SUPPRESS_CS;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:81:62
   return SUPPRESS_CS;
 }
 
-function nestedLoopCount(body: string, stack: Stack): number {
-  if (stack === 'python') return (body.match(/^\s*for\s+\w+\s+in\s+/gm) ?? []).length;
-  if (stack === 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) ?? []).length;
-  return (body.match(/for\s*\(/g) ?? []).length;
-}
+function nestedLoopCount(body: string, stack: Stack): number {}
 
 function findFunctionAt(lines: string[], i: number, stack: Stack): { name: string; line: number } | null {
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API nestedLoopCount counts `for (...)` for TS stack (FAILS if regex broken)
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:82:7
 }
 
 function nestedLoopCount(body: string, stack: Stack): number {
-  if (stack === 'python') return (body.match(/^\s*for\s+\w+\s+in\s+/gm) ?? []).length;
+  if (true) return (body.match(/^\s*for\s+\w+\s+in\s+/gm) ?? []).length;
   if (stack === 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) ?? []).length;
   return (body.match(/for\s*\(/g) ?? []).length;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API nestedLoopCount counts `for (...)` for TS stack (FAILS if regex broken)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:82:35
 }
 
 function nestedLoopCount(body: string, stack: Stack): number {
-  if (stack === 'python') return (body.match(/^\s*for\s+\w+\s+in\s+/gm) ?? []).length;
+  if (stack === 'python') return (body.match(/^\s*for\s+\w+\s+in\s+/gm) && []).length;
   if (stack === 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) ?? []).length;
   return (body.match(/for\s*\(/g) ?? []).length;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API nestedLoopCount counts ONLY `for X in Y:` for Python (FAILS if Python regex matches C-style for)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:83:7
 
 function nestedLoopCount(body: string, stack: Stack): number {
   if (stack === 'python') return (body.match(/^\s*for\s+\w+\s+in\s+/gm) ?? []).length;
-  if (stack === 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) ?? []).length;
+  if (stack !== 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) ?? []).length;
   return (body.match(/for\s*\(/g) ?? []).length;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API nestedLoopCount counts both `for (` AND `foreach (` for C# (FAILS if csharp branch missing foreach)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] LogicalOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:83:35
 
 function nestedLoopCount(body: string, stack: Stack): number {
   if (stack === 'python') return (body.match(/^\s*for\s+\w+\s+in\s+/gm) ?? []).length;
-  if (stack === 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) ?? []).length;
+  if (stack === 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) && []).length;
   return (body.match(/for\s*\(/g) ?? []).length;
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API nestedLoopCount counts both `for (` AND `foreach (` for C# (FAILS if csharp branch missing foreach)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:84:11
 function nestedLoopCount(body: string, stack: Stack): number {
   if (stack === 'python') return (body.match(/^\s*for\s+\w+\s+in\s+/gm) ?? []).length;
   if (stack === 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) ?? []).length;
-  return (body.match(/for\s*\(/g) ?? []).length;
+  return (body.match(/for\s*\(/g) && []).length;
 }
 
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API nestedLoopCount counts `for (...)` for TS stack (FAILS if regex broken)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] Regex
skills/strong-tests/scripts/detect-invariant-candidates.ts:84:22
 function nestedLoopCount(body: string, stack: Stack): number {
   if (stack === 'python') return (body.match(/^\s*for\s+\w+\s+in\s+/gm) ?? []).length;
   if (stack === 'csharp') return (body.match(/(?:^|\s)(?:for|foreach)\s*\(/g) ?? []).length;
-  return (body.match(/for\s*\(/g) ?? []).length;
+  return (body.match(/for\S*\(/g) ?? []).length;
 }
 
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API nestedLoopCount counts `for (...)` for TS stack (FAILS if regex broken)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:87:106
   return (body.match(/for\s*\(/g) ?? []).length;
 }
 
-function findFunctionAt(lines: string[], i: number, stack: Stack): { name: string; line: number } | null {
-  const re = functionRegexFor(stack);
-  const m = re.exec(lines[i]);
-  if (!m) return null;
-  const name = (m[1] || m[2] || '').trim();
-  if (!name) return null;
-  return { name, line: i };
-}
+function findFunctionAt(lines: string[], i: number, stack: Stack): { name: string; line: number } | null {}
 
 function scan(content: string, stack: Stack): { candidates: Candidate[]; suppressed: Suppressed[] } {
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:90:7
 function findFunctionAt(lines: string[], i: number, stack: Stack): { name: string; line: number } | null {
   const re = functionRegexFor(stack);
   const m = re.exec(lines[i]);
-  if (!m) return null;
+  if (true) return null;
   const name = (m[1] || m[2] || '').trim();
   if (!name) return null;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:90:7
 function findFunctionAt(lines: string[], i: number, stack: Stack): { name: string; line: number } | null {
   const re = functionRegexFor(stack);
   const m = re.exec(lines[i]);
-  if (!m) return null;
+  if (m) return null;
   const name = (m[1] || m[2] || '').trim();
   if (!name) return null;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan returns empty candidates/suppressed for empty content (FAILS if scan crashes on empty)
statusReason: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:91:17
   const re = functionRegexFor(stack);
   const m = re.exec(lines[i]);
   if (!m) return null;
-  const name = (m[1] || m[2] || '').trim();
+  const name = (true).trim();
   if (!name) return null;
   return { name, line: i };
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: (intermediate value)(intermediate value)(intermediate value).trim is not a function

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:91:17
   const re = functionRegexFor(stack);
   const m = re.exec(lines[i]);
   if (!m) return null;
-  const name = (m[1] || m[2] || '').trim();
+  const name = (false).trim();
   if (!name) return null;
   return { name, line: i };
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: (intermediate value)(intermediate value)(intermediate value).trim is not a function

[Killed] BooleanLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:92:7
   const m = re.exec(lines[i]);
   if (!m) return null;
   const name = (m[1] || m[2] || '').trim();
-  if (!name) return null;
+  if (name) return null;
   return { name, line: i };
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:92:7
   const m = re.exec(lines[i]);
   if (!m) return null;
   const name = (m[1] || m[2] || '').trim();
-  if (!name) return null;
+  if (true) return null;
   return { name, line: i };
 }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:97:31
 }
 
 function scan(content: string, stack: Stack): { candidates: Candidate[]; suppressed: Suppressed[] } {
-  const lines = content.split('\n');
+  const lines = content.split("");
   const candidates: Candidate[] = [];
   const suppressed: Suppressed[] = [];
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrayDeclaration
skills/strong-tests/scripts/detect-invariant-candidates.ts:99:36
 function scan(content: string, stack: Stack): { candidates: Candidate[]; suppressed: Suppressed[] } {
   const lines = content.split('\n');
   const candidates: Candidate[] = [];
-  const suppressed: Suppressed[] = [];
+  const suppressed: Suppressed[] = ["Stryker was here"];
   const suppressRe = suppressRegexFor(stack);
   const typeRe = collectionRegexFor(stack);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan returns empty candidates/suppressed for empty content (FAILS if scan crashes on empty)
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] UpdateOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:104:37
   const typeRe = collectionRegexFor(stack);
   const suppressedLines = new Set<number>();
 
-  for (let i = 0; i < lines.length; i++) {
+  for (let i = 0; i < lines.length; i--) {
     const m = lines[i].match(suppressRe);
     if (!m) continue;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan returns empty candidates/suppressed for empty content (FAILS if scan crashes on empty)
statusReason: Cannot read properties of undefined (reading 'match')

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:106:9
 
   for (let i = 0; i < lines.length; i++) {
     const m = lines[i].match(suppressRe);
-    if (!m) continue;
+    if (false) continue;
     const reason = m[1].trim();
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan returns empty candidates/suppressed for empty content (FAILS if scan crashes on empty)
statusReason: Cannot read properties of null (reading '1')

[Killed] BooleanLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:106:9
 
   for (let i = 0; i < lines.length; i++) {
     const m = lines[i].match(suppressRe);
-    if (!m) continue;
+    if (m) continue;
     const reason = m[1].trim();
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan returns empty candidates/suppressed for empty content (FAILS if scan crashes on empty)
statusReason: Cannot read properties of null (reading '1')

[Survived] MethodExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:107:20
   for (let i = 0; i < lines.length; i++) {
     const m = lines[i].match(suppressRe);
     if (!m) continue;
-    const reason = m[1].trim();
+    const reason = m[1];
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
     if (!target) {

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:109:9
     if (!m) continue;
     const reason = m[1].trim();
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
-    if (!target) {
+    if (true) {
       for (let j = i + 1; j < Math.min(lines.length, i + 4); j++) {
         if (lines[j].trim() === '') continue;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan suppression same-line form on function declaration line attaches correctly (FAILS if same-line path broken)
statusReason: expected 'other:2' to be 'quick:1' // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:109:9
     if (!m) continue;
     const reason = m[1].trim();
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
-    if (!target) {
+    if (false) {
       for (let j = i + 1; j < Math.min(lines.length, i + 4); j++) {
         if (lines[j].trim() === '') continue;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:110:54
     const reason = m[1].trim();
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
     if (!target) {
-      for (let j = i + 1; j < Math.min(lines.length, i + 4); j++) {
+      for (let j = i + 1; j < Math.min(lines.length, i - 4); j++) {
         if (lines[j].trim() === '') continue;
         const next = findFunctionAt(lines, j, stack);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:110:27
     const reason = m[1].trim();
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
     if (!target) {
-      for (let j = i + 1; j < Math.min(lines.length, i + 4); j++) {
+      for (let j = i + 1; false; j++) {
         if (lines[j].trim() === '') continue;
         const next = findFunctionAt(lines, j, stack);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:111:13
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
     if (!target) {
       for (let j = i + 1; j < Math.min(lines.length, i + 4); j++) {
-        if (lines[j].trim() === '') continue;
+        if (true) continue;
         const next = findFunctionAt(lines, j, stack);
         if (next) {
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:111:13
     let target: { name: string; line: number } | null = findFunctionAt(lines, i, stack);
     if (!target) {
       for (let j = i + 1; j < Math.min(lines.length, i + 4); j++) {
-        if (lines[j].trim() === '') continue;
+        if (lines[j].trim() !== '') continue;
         const next = findFunctionAt(lines, j, stack);
         if (next) {
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:113:13
       for (let j = i + 1; j < Math.min(lines.length, i + 4); j++) {
         if (lines[j].trim() === '') continue;
         const next = findFunctionAt(lines, j, stack);
-        if (next) {
+        if (false) {
           target = next;
           break;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:113:19
       for (let j = i + 1; j < Math.min(lines.length, i + 4); j++) {
         if (lines[j].trim() === '') continue;
         const next = findFunctionAt(lines, j, stack);
-        if (next) {
-          target = next;
-          break;
-        }
+        if (next) {}
         break;
       }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:120:17
         break;
       }
     }
-    if (target) {
-      suppressedLines.add(target.line);
-      suppressed.push({
-        function: `${target.name}:${target.line + 1}`,
-        line: target.line + 1,
-        reason,
-        reasonLength: reason.length,
-        reasonWarning: reason.length < 8 ? 'REASON_TOO_SHORT' : null,
-      });
-    }
+    if (target) {}
   }
 
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan parses Python suppression with reason ≥8 chars (FAILS if suppression parse broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:120:9
         break;
       }
     }
-    if (target) {
+    if (true) {
       suppressedLines.add(target.line);
       suppressed.push({
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan suppression lookahead bounded to i+4 lines — function 5+ lines below NOT attached (FAILS if Math.min→Math.max)
statusReason: Cannot read properties of null (reading 'line')

[Killed] ArithmeticOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:123:37
     if (target) {
       suppressedLines.add(target.line);
       suppressed.push({
-        function: `${target.name}:${target.line + 1}`,
+        function: `${target.name}:${target.line - 1}`,
         line: target.line + 1,
         reason,
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan suppressed.function string format = name:1-indexed-line (FAILS if +1 → -1 off-by-one)
statusReason: expected 'leaf:1' to be 'leaf:3' // Object.is equality

[Killed] StringLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:123:19
     if (target) {
       suppressedLines.add(target.line);
       suppressed.push({
-        function: `${target.name}:${target.line + 1}`,
+        function: ``,
         line: target.line + 1,
         reason,
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan suppressed.function string format = name:1-indexed-line (FAILS if +1 → -1 off-by-one)
statusReason: expected '' to be 'leaf:3' // Object.is equality

[Killed] ArithmeticOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:124:15
       suppressedLines.add(target.line);
       suppressed.push({
         function: `${target.name}:${target.line + 1}`,
-        line: target.line + 1,
+        line: target.line - 1,
         reason,
         reasonLength: reason.length,
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan suppressed.function string format = name:1-indexed-line (FAILS if +1 → -1 off-by-one)
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:127:24
         line: target.line + 1,
         reason,
         reasonLength: reason.length,
-        reasonWarning: reason.length < 8 ? 'REASON_TOO_SHORT' : null,
+        reasonWarning: false ? 'REASON_TOO_SHORT' : null,
       });
     }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan flags reason <8 chars as REASON_TOO_SHORT (FAILS if boundary check removed)
statusReason: expected null to be 'REASON_TOO_SHORT' // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:127:24
         line: target.line + 1,
         reason,
         reasonLength: reason.length,
-        reasonWarning: reason.length < 8 ? 'REASON_TOO_SHORT' : null,
+        reasonWarning: reason.length <= 8 ? 'REASON_TOO_SHORT' : null,
       });
     }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan reason boundary: exactly 8 chars → no warning (FAILS if off-by-one)
statusReason: expected 'REASON_TOO_SHORT' to be null // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:133:9
   }
 
   for (let i = 0; i < lines.length; i++) {
-    if (suppressedLines.has(i)) continue;
+    if (true) continue;
     const target = findFunctionAt(lines, i, stack);
     if (!target) continue;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:133:9
   }
 
   for (let i = 0; i < lines.length; i++) {
-    if (suppressedLines.has(i)) continue;
+    if (false) continue;
     const target = findFunctionAt(lines, i, stack);
     if (!target) continue;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan suppression same-line form on function declaration line attaches correctly (FAILS if same-line path broken)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:135:9
   for (let i = 0; i < lines.length; i++) {
     if (suppressedLines.has(i)) continue;
     const target = findFunctionAt(lines, i, stack);
-    if (!target) continue;
+    if (true) continue;
     const window = lines.slice(i, Math.min(lines.length, i + 5)).join('\n');
     const typeMatch = typeRe.exec(window);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:135:9
   for (let i = 0; i < lines.length; i++) {
     if (suppressedLines.has(i)) continue;
     const target = findFunctionAt(lines, i, stack);
-    if (!target) continue;
+    if (target) continue;
     const window = lines.slice(i, Math.min(lines.length, i + 5)).join('\n');
     const typeMatch = typeRe.exec(window);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:136:20
     if (suppressedLines.has(i)) continue;
     const target = findFunctionAt(lines, i, stack);
     if (!target) continue;
-    const window = lines.slice(i, Math.min(lines.length, i + 5)).join('\n');
+    const window = lines.join('\n');
     const typeMatch = typeRe.exec(window);
     if (!typeMatch) continue;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan return type window bounded to next 5 lines — distant return type does NOT cross-attach (FAILS if i+5 → larger)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:136:35
     if (suppressedLines.has(i)) continue;
     const target = findFunctionAt(lines, i, stack);
     if (!target) continue;
-    const window = lines.slice(i, Math.min(lines.length, i + 5)).join('\n');
+    const window = lines.slice(i, Math.max(lines.length, i + 5)).join('\n');
     const typeMatch = typeRe.exec(window);
     if (!typeMatch) continue;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan return type window bounded to next 5 lines — distant return type does NOT cross-attach (FAILS if i+5 → larger)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:138:9
     if (!target) continue;
     const window = lines.slice(i, Math.min(lines.length, i + 5)).join('\n');
     const typeMatch = typeRe.exec(window);
-    if (!typeMatch) continue;
+    if (typeMatch) continue;
     const returnType = typeMatch[1].trim();
     const endLine = Math.min(lines.length - 1, i + 40);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:138:9
     if (!target) continue;
     const window = lines.slice(i, Math.min(lines.length, i + 5)).join('\n');
     const typeMatch = typeRe.exec(window);
-    if (!typeMatch) continue;
+    if (true) continue;
     const returnType = typeMatch[1].trim();
     const endLine = Math.min(lines.length - 1, i + 40);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan detects TS function returning Array<T> (FAILS if TS collection regex broken)
statusReason: expected +0 to be 1 // Object.is equality

[Survived] MethodExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:139:24
     const window = lines.slice(i, Math.min(lines.length, i + 5)).join('\n');
     const typeMatch = typeRe.exec(window);
     if (!typeMatch) continue;
-    const returnType = typeMatch[1].trim();
+    const returnType = typeMatch[1];
     const endLine = Math.min(lines.length - 1, i + 40);
     const body = lines.slice(i, endLine + 1).join('\n');

[Killed] MethodExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:140:21
     const typeMatch = typeRe.exec(window);
     if (!typeMatch) continue;
     const returnType = typeMatch[1].trim();
-    const endLine = Math.min(lines.length - 1, i + 40);
+    const endLine = Math.max(lines.length - 1, i + 40);
     const body = lines.slice(i, endLine + 1).join('\n');
     const nestedFor = nestedLoopCount(body, stack);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan endLine bounded to 40 lines from function start (FAILS if 40 → larger)
statusReason: expected 41 to be 3 // Object.is equality

[Killed] ArithmeticOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:140:30
     const typeMatch = typeRe.exec(window);
     if (!typeMatch) continue;
     const returnType = typeMatch[1].trim();
-    const endLine = Math.min(lines.length - 1, i + 40);
+    const endLine = Math.min(lines.length + 1, i + 40);
     const body = lines.slice(i, endLine + 1).join('\n');
     const nestedFor = nestedLoopCount(body, stack);
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan endLine bounded to 40 lines from function start (FAILS if 40 → larger)
statusReason: expected 5 to be 3 // Object.is equality
