[Killed] MethodExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:141:18
     if (!typeMatch) continue;
     const returnType = typeMatch[1].trim();
     const endLine = Math.min(lines.length - 1, i + 40);
-    const body = lines.slice(i, endLine + 1).join('\n');
+    const body = lines.join('\n');
     const nestedFor = nestedLoopCount(body, stack);
     let kind: Candidate['kind'] = 'collection-returning';
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan nested loops outside function body do NOT cross-attach (FAILS if endLine slice unbounded)
statusReason: expected 'nxm-overlap' to be 'collection-returning' // Object.is equality

[Survived] ArithmeticOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:141:33
     if (!typeMatch) continue;
     const returnType = typeMatch[1].trim();
     const endLine = Math.min(lines.length - 1, i + 40);
-    const body = lines.slice(i, endLine + 1).join('\n');
+    const body = lines.slice(i, endLine - 1).join('\n');
     const nestedFor = nestedLoopCount(body, stack);
     let kind: Candidate['kind'] = 'collection-returning';

[Killed] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:145:25
     const nestedFor = nestedLoopCount(body, stack);
     let kind: Candidate['kind'] = 'collection-returning';
     let rationale = `function signature returns ${returnType}`;
-    if (nestedFor >= 2) {
-      kind = 'nxm-overlap';
-      rationale += `; nested loop body detected (${nestedFor} for/foreach statements)`;
-    }
+    if (nestedFor >= 2) {}
     candidates.push({
       function: target.name,
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan flags TS nested-for as nxm-overlap (FAILS if loop counting/threshold broken)
statusReason: expected 'collection-returning' to be 'nxm-overlap' // Object.is equality

[Killed] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:145:9
     const nestedFor = nestedLoopCount(body, stack);
     let kind: Candidate['kind'] = 'collection-returning';
     let rationale = `function signature returns ${returnType}`;
-    if (nestedFor >= 2) {
+    if (nestedFor > 2) {
       kind = 'nxm-overlap';
       rationale += `; nested loop body detected (${nestedFor} for/foreach statements)`;
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan flags TS nested-for as nxm-overlap (FAILS if loop counting/threshold broken)
statusReason: expected 'collection-returning' to be 'nxm-overlap' // Object.is equality

[Killed] StringLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:146:14
     let kind: Candidate['kind'] = 'collection-returning';
     let rationale = `function signature returns ${returnType}`;
     if (nestedFor >= 2) {
-      kind = 'nxm-overlap';
+      kind = "";
       rationale += `; nested loop body detected (${nestedFor} for/foreach statements)`;
     }
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan flags TS nested-for as nxm-overlap (FAILS if loop counting/threshold broken)
statusReason: expected '' to be 'nxm-overlap' // Object.is equality

[Killed] ArithmeticOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:151:13
     }
     candidates.push({
       function: target.name,
-      line: target.line + 1,
+      line: target.line - 1,
       endLine: endLine + 1,
       kind,
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan candidate.line = 1-indexed function declaration line (FAILS if +1 → -1)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:152:16
     candidates.push({
       function: target.name,
       line: target.line + 1,
-      endLine: endLine + 1,
+      endLine: endLine - 1,
       kind,
       returnType,
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan endLine bounded to 40 lines from function start (FAILS if 40 → larger)
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ObjectLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:160:10
     });
   }
 
-  return { candidates, suppressed };
+  return {};
 }
 
killedBy: TESTQUAL001_UNIT: detect-invariant-candidates module API scan returns empty candidates/suppressed for empty content (FAILS if scan crashes on empty)
statusReason: expected undefined to deeply equal []

[NoCoverage] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:169:18
 function main(): void {
   const t0 = Date.now();
   const filePath = process.argv[2];
-  if (!filePath) {
-    process.stderr.write('Usage: detect-invariant-candidates.ts <file-path>\n');
-    process.exit(2);
-  }
+  if (!filePath) {}
   const stack = detectStack(filePath);
   let content: string;

[NoCoverage] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:169:7
 function main(): void {
   const t0 = Date.now();
   const filePath = process.argv[2];
-  if (!filePath) {
+  if (false) {
     process.stderr.write('Usage: detect-invariant-candidates.ts <file-path>\n');
     process.exit(2);

[NoCoverage] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:175:7
   }
   const stack = detectStack(filePath);
   let content: string;
-  try {
-    content = fs.readFileSync(filePath, 'utf-8');
-  } catch {
+  try {} catch {
     process.stderr.write(`File not readable: ${filePath}\n`);
     process.exit(2);

[NoCoverage] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:177:11
   let content: string;
   try {
     content = fs.readFileSync(filePath, 'utf-8');
-  } catch {
-    process.stderr.write(`File not readable: ${filePath}\n`);
-    process.exit(2);
-  }
+  } catch {}
   let candidates: Candidate[] = [];
   let suppressed: Suppressed[] = [];

[NoCoverage] StringLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:178:26
   try {
     content = fs.readFileSync(filePath, 'utf-8');
   } catch {
-    process.stderr.write(`File not readable: ${filePath}\n`);
+    process.stderr.write(``);
     process.exit(2);
   }

[NoCoverage] ArrayDeclaration
skills/strong-tests/scripts/detect-invariant-candidates.ts:181:33
     process.stderr.write(`File not readable: ${filePath}\n`);
     process.exit(2);
   }
-  let candidates: Candidate[] = [];
+  let candidates: Candidate[] = ["Stryker was here"];
   let suppressed: Suppressed[] = [];
   if (stack === 'ts' || stack === 'python' || stack === 'csharp') {

[NoCoverage] EqualityOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:183:25
   }
   let candidates: Candidate[] = [];
   let suppressed: Suppressed[] = [];
-  if (stack === 'ts' || stack === 'python' || stack === 'csharp') {
+  if (stack === 'ts' || stack !== 'python' || stack === 'csharp') {
     const result = scan(content, stack);
     candidates = result.candidates;

[NoCoverage] LogicalOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:183:7
   }
   let candidates: Candidate[] = [];
   let suppressed: Suppressed[] = [];
-  if (stack === 'ts' || stack === 'python' || stack === 'csharp') {
+  if (stack === 'ts' && stack === 'python' || stack === 'csharp') {
     const result = scan(content, stack);
     candidates = result.candidates;

[NoCoverage] ObjectLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:188:34
     candidates = result.candidates;
     suppressed = result.suppressed;
   }
-  const output: DetectorOutput = {
-    schemaVersion: 1,
-    file: filePath,
-    stack,
-    candidates,
-    suppressed,
-    scanDurationMs: Date.now() - t0,
-    astGrepVersion: null,
-  };
+  const output: DetectorOutput = {};
   process.stdout.write(JSON.stringify(output, null, 2) + '\n');
   process.exit(0);

[NoCoverage] ArithmeticOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:194:21
     stack,
     candidates,
     suppressed,
-    scanDurationMs: Date.now() - t0,
+    scanDurationMs: Date.now() + t0,
     astGrepVersion: null,
   };

[NoCoverage] StringLiteral
skills/strong-tests/scripts/detect-invariant-candidates.ts:197:58
     scanDurationMs: Date.now() - t0,
     astGrepVersion: null,
   };
-  process.stdout.write(JSON.stringify(output, null, 2) + '\n');
+  process.stdout.write(JSON.stringify(output, null, 2) + "");
   process.exit(0);
 }

[Survived] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:202:3
 }
 
 const isDirectRun =
-  process.argv[1]?.endsWith('detect-invariant-candidates.ts') ||
-  process.argv[1]?.endsWith('detect-invariant-candidates.js');
+  false;
 if (isDirectRun) {
   main();

[Survived] LogicalOperator
skills/strong-tests/scripts/detect-invariant-candidates.ts:202:3
 }
 
 const isDirectRun =
-  process.argv[1]?.endsWith('detect-invariant-candidates.ts') ||
-  process.argv[1]?.endsWith('detect-invariant-candidates.js');
+  process.argv[1]?.endsWith('detect-invariant-candidates.ts') && process.argv[1]?.endsWith('detect-invariant-candidates.js');
 if (isDirectRun) {
   main();

[Survived] OptionalChaining
skills/strong-tests/scripts/detect-invariant-candidates.ts:203:3
 
 const isDirectRun =
   process.argv[1]?.endsWith('detect-invariant-candidates.ts') ||
-  process.argv[1]?.endsWith('detect-invariant-candidates.js');
+  process.argv[1].endsWith('detect-invariant-candidates.js');
 if (isDirectRun) {
   main();

[Survived] MethodExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:203:3
 
 const isDirectRun =
   process.argv[1]?.endsWith('detect-invariant-candidates.ts') ||
-  process.argv[1]?.endsWith('detect-invariant-candidates.js');
+  process.argv[1]?.startsWith('detect-invariant-candidates.js');
 if (isDirectRun) {
   main();

[Survived] ConditionalExpression
skills/strong-tests/scripts/detect-invariant-candidates.ts:204:5
 const isDirectRun =
   process.argv[1]?.endsWith('detect-invariant-candidates.ts') ||
   process.argv[1]?.endsWith('detect-invariant-candidates.js');
-if (isDirectRun) {
+if (false) {
   main();
 }

[NoCoverage] BlockStatement
skills/strong-tests/scripts/detect-invariant-candidates.ts:204:18
 const isDirectRun =
   process.argv[1]?.endsWith('detect-invariant-candidates.ts') ||
   process.argv[1]?.endsWith('detect-invariant-candidates.js');
-if (isDirectRun) {
-  main();
-}
+if (isDirectRun) {}
 
